Show / Hide Table of Contents
Enum ExposureClassEc2
Type of exposure class
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum ExposureClassEc2
Fields
 Name |  Description
 X0
No risk of corrosion or attack - very dry
 XA1
Chemical attack - slightly aggressive chemical environment according to EN 206-1, Table 2
 XA2
Chemical attack - moderately aggressive chemical environment according to EN 206-1, Table 2
 XA3
Chemical attack - highly aggressive chemical environment according to EN 206-1, Table 2
 XC1
Corrosion induced by carbonation - dry or permanently wet
 XC2
Corrosion induced by carbonation - wet, rarely dry
 XC3
Corrosion induced by carbonation - moderate humidity
 XC4
Corrosion induced by carbonation - cyclic wet and dry
 XD1
Corrosion induced by chlorides - moderate humidity
 XD2
Corrosion induced by chlorides - wet, rarely dry
 XD3
Corrosion induced by chlorides - cyclic wet and dry
 XF1
Freeze/Thaw Attack - moderate water saturation, without de-icing agent
 XF2
Freeze/Thaw Attack - moderate water saturation, with de-icing agent
 XF3
Freeze/Thaw Attack - high water saturation, without de-icing agents
 XF4
Freeze/Thaw Attack - high water saturation with de-icing agents or sea water
 XS1
Corrosion induced by chlorides from sea water - exposed to airborne salt but not in direct contact with sea water
 XS2
Corrosion induced by chlorides from sea water - permanently submerged
 XS3
Corrosion induced by chlorides from sea water - tidal, splash and spray zones
 Improve this Doc
 View Source